import './style.css';

export const ProductDoorGuarantee = () => {
  return (
    <div className="product-door-guarantee-wrapper">
      <h2>Умови гарантії</h2>
      <p>Гарантійний термін починається з дня отримання дверей від служби доставки.</p>
      <p>Терміни дії гарантії:</p>
      <ul className="product-door-guarantee-list">
        <li>
          <p className="product-door-guarantee-list-item">
            на сам виріб (основна конструкція дверей: каркас створки, рами, лист металу створки
            полотна, петлі) - гарантія 1 рік з дати виготовлення;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            на циліндричний механізм і комплектуючі (вічко, ручки, ущільнювач і накладки на замки) -
            6 місяців;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">на декоративні накладки – 1 рік.</p>
        </li>
      </ul>
      <p>Гарантія не розповсюджується на комплектуючі, які надає замовник!</p>
      <p>
        Монтаж дверей повинен виконуватись фахівцями, при цьому особа, що встановила виріб, несе
        відповідальність за якість установки. Просимо Вас звернути увагу на важливість правильної
        установки виробу, як для його подальшого надійного використання, так і для отримання
        гарантійного обслуговування.{' '}
      </p>
      <p>
        Виробник не несе відповідальність за можливу шкоду, прямо чи побічно заподіяну продукції з
        необережних дій споживача чи інших осіб, а також за можливі збитки споживача за час,
        протягом якого він не мав нагоди користуватися виробом.
      </p>
      <p>Гарантійні зобов'язання на виріб не поширюються в наступних випадках:</p>
      <ul className="product-door-guarantee-list">
        <li>
          <p className="product-door-guarantee-list-item">
            замовником виконана самостійна установка додаткового обладнання;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            порушені правила установки і експлуатації, викладені в даному паспорті;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            виріб має сліди спроб не кваліфікованого ремонту;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            були використані агресивні рідини або ж миючі засоби з активними компонентами, які
            привели до псування оздоблювального покриття і (або) фурнітури виробу;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            відбулося замерзання мастильних матеріалів, створення конденсату і нальоту на полотні і
            замках, а також корозії замків і металевих частин полотна через відсутність сухого і
            провітрюваного тамбура між дверима і основним приміщенням;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">форс-мажорних обставин;</p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            cтіхійних лих (пожежа, землетрус, повінь і т.п.).
          </p>
        </li>
      </ul>
      <strong>Рекомендовані умови експлуатації:</strong>
      <ul className="product-door-guarantee-list">
        <li>
          <p className="product-door-guarantee-list-item">
            для очищення від забруднень рекомендується застосовувати засоби по догляду за меблями, а
            також вологу і м'яку тканину. Забороняється використовувати для очищення вироби
            розчинники, луги, кислоти, тобто агресивні миючі засоби та матеріали;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            уникати утворення конденсату на рамі та дверях;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            у разі встановлення дверей з виходом на вулицю обов'язково наявність захисного
            зовнішнього козирка і рекомендується наявність прохолодного тамбура всередині
            приміщення;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            розмір козирка є індивідуальним для кожного розміру двері, а також залежить від «руху»
            сонця щодо двері в перебігу дня. Рекомендується не піддавати виріб різким перепадам
            температур і уникати попадання на виріб прямих сонячних променів;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            забороняється прямий контакт вироби з поверхнями, температура яких перевищує 60°С;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            замки в двері не повинні піддаватися термічному, хімічному та механічному впливу.
            Пам'ятайте, що в разі самостійного розбору і доопрацювання замків, більш не підлягає
            гарантійному обслуговуванню;
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            один раз на рік необхідно робити змащування петель і регулювання запірних механізмів (цю
            роботу повинен виконувати фахівець);
          </p>
        </li>
        <li>
          <p className="product-door-guarantee-list-item">
            у процесі тривалої експлуатації може з'явитися люфт дверного полотна в закритому
            положенні засувки. В цьому випадку рекомендується замінити ущільнювач.
          </p>
        </li>
      </ul>
    </div>
  );
};
